Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv (Conv2D)                   (None, 111, 111, 32) 864         input_2[0][0]                    
__________________________________________________________________________________________________
BN (BatchNormalization)         (None, 111, 111, 32) 128         conv[0][0]                       
__________________________________________________________________________________________________
ReLU (ReLU)                     (None, 111, 111, 32) 0           BN[0][0]                         
__________________________________________________________________________________________________
Bottleneck_B1_1 (Bottleneck)    (None, 111, 111, 16) 2144        ReLU[0][0]                       
__________________________________________________________________________________________________
Bottleneck_B2_1 (Bottleneck)    (None, 56, 56, 24)   5568        Bottleneck_B1_1[0][0]            
__________________________________________________________________________________________________
Bottleneck_B2_2 (Bottleneck)    (None, 56, 56, 24)   9456        Bottleneck_B2_1[0][0]            
__________________________________________________________________________________________________
Bottleneck_B3_1 (Bottleneck)    (None, 28, 28, 32)   10640       Bottleneck_B2_2[0][0]            
__________________________________________________________________________________________________
Bottleneck_B3_2 (Bottleneck)    (None, 28, 28, 32)   15680       Bottleneck_B3_1[0][0]            
__________________________________________________________________________________________________
Bottleneck_B3_3 (Bottleneck)    (None, 28, 28, 32)   15680       Bottleneck_B3_2[0][0]            
__________________________________________________________________________________________________
Bottleneck_B4_1 (Bottleneck)    (None, 14, 14, 64)   21952       Bottleneck_B3_3[0][0]            
__________________________________________________________________________________________________
Bottleneck_B4_2 (Bottleneck)    (None, 14, 14, 64)   55936       Bottleneck_B4_1[0][0]            
__________________________________________________________________________________________________
Bottleneck_B4_3 (Bottleneck)    (None, 14, 14, 64)   55936       Bottleneck_B4_2[0][0]            
__________________________________________________________________________________________________
Bottleneck_B4_4 (Bottleneck)    (None, 14, 14, 64)   55936       Bottleneck_B4_3[0][0]            
__________________________________________________________________________________________________
Bottleneck_B5_1 (Bottleneck)    (None, 14, 14, 96)   68352       Bottleneck_B4_4[0][0]            
__________________________________________________________________________________________________
Bottleneck_B5_2 (Bottleneck)    (None, 14, 14, 96)   120768      Bottleneck_B5_1[0][0]            
__________________________________________________________________________________________________
Bottleneck_B5_3_expand (Conv2D) (None, 14, 14, 576)  55296       Bottleneck_B5_2[0][0]            
__________________________________________________________________________________________________
Bottleneck_B5_3_expand_BN (Batc (None, 14, 14, 576)  2304        Bottleneck_B5_3_expand[0][0]     
__________________________________________________________________________________________________
Bottleneck_B5_3_expand_ReLU (Re (None, 14, 14, 576)  0           Bottleneck_B5_3_expand_BN[0][0]  
__________________________________________________________________________________________________
SSD_conv_1_1 (Conv2D)           (None, 14, 14, 256)  147712      Bottleneck_B5_3_expand_ReLU[0][0]
__________________________________________________________________________________________________
SSD_conv_1_2 (Conv2D)           (None, 7, 7, 512)    1180160     SSD_conv_1_1[0][0]               
__________________________________________________________________________________________________
SSD_conv_2_1 (Conv2D)           (None, 7, 7, 128)    65664       SSD_conv_1_2[0][0]               
__________________________________________________________________________________________________
SSD_conv_2_2 (Conv2D)           (None, 4, 4, 256)    295168      SSD_conv_2_1[0][0]               
__________________________________________________________________________________________________
SSD_conv_3_1 (Conv2D)           (None, 4, 4, 128)    32896       SSD_conv_2_2[0][0]               
__________________________________________________________________________________________________
Bottleneck_B4_1_expand (Conv2D) (None, 28, 28, 192)  6144        Bottleneck_B3_3[0][0]            
__________________________________________________________________________________________________
SSD_conv_3_2 (Conv2D)           (None, 2, 2, 256)    295168      SSD_conv_3_1[0][0]               
__________________________________________________________________________________________________
Bottleneck_B4_1_expand_BN (Batc (None, 28, 28, 192)  768         Bottleneck_B4_1_expand[0][0]     
__________________________________________________________________________________________________
SSD_conv_4_1 (Conv2D)           (None, 2, 2, 128)    32896       SSD_conv_3_2[0][0]               
__________________________________________________________________________________________________
Bottleneck_B4_1_expand_ReLU (Re (None, 28, 28, 192)  0           Bottleneck_B4_1_expand_BN[0][0]  
__________________________________________________________________________________________________
SSD_conv_4_2 (Conv2D)           (None, 1, 1, 256)    131328      SSD_conv_4_1[0][0]               
__________________________________________________________________________________________________
Classification_0 (Conv2D)       (None, 28, 28, 45)   77805       Bottleneck_B4_1_expand_ReLU[0][0]
__________________________________________________________________________________________________
Classification_1 (Conv2D)       (None, 14, 14, 45)   233325      Bottleneck_B5_3_expand_ReLU[0][0]
__________________________________________________________________________________________________
Classification_2 (Conv2D)       (None, 7, 7, 45)     207405      SSD_conv_1_2[0][0]               
__________________________________________________________________________________________________
Classification_3 (Conv2D)       (None, 4, 4, 45)     103725      SSD_conv_2_2[0][0]               
__________________________________________________________________________________________________
Classification_4 (Conv2D)       (None, 2, 2, 45)     103725      SSD_conv_3_2[0][0]               
__________________________________________________________________________________________________
Classification_5 (Conv2D)       (None, 1, 1, 45)     103725      SSD_conv_4_2[0][0]               
__________________________________________________________________________________________________
Reshape_classification_0 (Resha (None, 2352, 15)     0           Classification_0[0][0]           
__________________________________________________________________________________________________
Reshape_classification_1 (Resha (None, 588, 15)      0           Classification_1[0][0]           
__________________________________________________________________________________________________
Reshape_classification_2 (Resha (None, 147, 15)      0           Classification_2[0][0]           
__________________________________________________________________________________________________
Reshape_classification_3 (Resha (None, 48, 15)       0           Classification_3[0][0]           
__________________________________________________________________________________________________
Reshape_classification_4 (Resha (None, 12, 15)       0           Classification_4[0][0]           
__________________________________________________________________________________________________
Reshape_classification_5 (Resha (None, 3, 15)        0           Classification_5[0][0]           
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3150, 15)     0           Reshape_classification_0[0][0]   
                                                                 Reshape_classification_1[0][0]   
                                                                 Reshape_classification_2[0][0]   
                                                                 Reshape_classification_3[0][0]   
                                                                 Reshape_classification_4[0][0]   
                                                                 Reshape_classification_5[0][0]   
==================================================================================================
Total params: 3,507,342
Trainable params: 3,492,494
Non-trainable params: 14,848